[
  {
    "title": "Booki",
    "mainScreenshot": "/booki.webp",
    "summary": "Intégration d'une page web en HTML et CSS",
    "detailsContext": "(Projet réalisé dans le cadre de ma formation)",
    "details": "La mission était d'intégrer en HTML/CSS la page d'accueil du site Booki, une agence de voyage. Toutes les maquettes étaient fournies en versions desktop, tablette et mobile. En découvrant le HTML et le CSS, j’ai cerné la plupart de leurs spécificités respectives, leurs règles ainsi que leurs possibilités. J’ai appris à détecter des bugs d’affichage en me servant des dev tools, et à adapter l’affichage du site sur les supports desktop, tablette et mobile. Une bonne introduction au HTML/CSS ainsi qu'au responsive.",
    "responsiveIllustration": "/booki-responsive.webp",
    "deployment": "https://yoannbonge.github.io/Booki/",
    "githubLink": "https://github.com/yoannBonge/Booki",
    "tools": ["HTML", "CSS"],
    "reverseRow": false
  },
  {
    "title": "Sophie Bluel",
    "mainScreenshot": "/sophie-bluel.webp",
    "summary": "Utilisation du Javascript pour rendre un site web dynamique",
    "detailsContext": "(Projet réalisé dans le cadre de ma formation)",
    "details": "La page d'accueil du site portfolio d'une architecte (Sophie Bluel) était fournie et statique. Il s'agissait de rendre le site dynamique grâce au Javascript. Une API était fonctionnelle afin de permettre la connexion au site, puis récupérer des projets contenant diverses informations grâce auxquelles j’ai pu programmer un filtrage de la galerie de photos et une modale pour ajouter/supprimer des projets. Un projet assez fourni qui m’a fait découvrir pas mal de procédés. Une bonne introduction au Javascript.",
    "responsiveIllustration": "/sophie-bluel-responsive.webp",
    "deployment": "",
    "githubLink": "https://github.com/yoannBonge/ArchiWebos",
    "tools": ["HTML", "CSS", "Javascript"],
    "reverseRow": true
  },
  {
    "title": "Nina Carducci",
    "mainScreenshot": "/nina-carducci.webp",
    "summary": "Optimisation du SEO d'un site web",
    "detailsContext": "(Projet réalisé dans le cadre de ma formation)",
    "details": "Le but de ce projet était d'optimiser le référencement et l'accessibilité d'un site portfolio d'une photographe, Nina Carducci. Quelques bugs étaient présents dans du code Jquery qu'il fallait rectifier. Modification des balises HTML et de leur agencement, implémentation de données structurées à l’aide du protocole Schema.org, traitement des images afin de réduire leur poids, initiation aux outils d'audit de performances tels que Lighthouse, d'accessibilité tels que Wave…",
    "responsiveIllustration": "/nina-carducci-responsive.webp",
    "deployment": "https://yoannbonge.github.io/NinaCarducci/",
    "githubLink": "https://github.com/yoannBonge/NinaCarducci",
    "tools": ["Lighthouse", "Wave"],
    "reverseRow": false
  },
  {
    "title": "Kasa",
    "mainScreenshot": "/kasa.webp",
    "summary": "Développement d'une application web avec React",
    "detailsContext": "(Projet réalisé dans le cadre de ma formation)",
    "details": "Il s'agissait de développer l'application responsive d'une agence de location de logements nommée Kasa, et ce grâce à la librairie React. Toutes les maquettes étaient fournies. De la création de plusieurs composants dont certains animés et interactifs (menu dropdown, carrousel) à la découverte du concept des hooks en passant par celle de l’utilisation du JSX, ou du langage Sass, ce projet m'a fait découvrir pas mal d'outils.",
    "responsiveIllustration": "/kasa-responsive.webp",
    "deployment": "",
    "githubLink": "https://github.com/yoannBonge/Kasa",
    "tools": ["React", "Sass"],
    "reverseRow": true
  },
  {
    "title": "Mon Vieux Grimoire",
    "mainScreenshot": "/mon-vieux-grimoire.webp",
    "summary": "Développement de l'API d'un site web",
    "detailsContext": "(Projet réalisé dans le cadre de ma formation)",
    "details": "Ce projet était destiné à nous initier au backend avec la création d'une API pour Mon \"Vieux Grimoire\", un site de notation de livres. Une initiation aux opérations CRUD, à la programmation de la création/connexion d’utilisateurs, avec diverses routes à créer à partir d'une spécification d'API. Utilisation de Node.js et son framework Express.js, base de données NoSQL MongoDB, gestion de modèles Mongoose, sécurisation de la base de données grâce au cryptage des mots de passe…",
    "responsiveIllustration": "/mon-vieux-grimoire-responsive.webp",
    "deployment": "",
    "githubLink": "https://github.com/yoannBonge/MonVieuxGrimoire",
    "tools": ["Node", "MongoDB", "Express"],
    "reverseRow": false
  },
  {
    "title": "Those Behind The Music",
    "mainScreenshot": "/those-behind-the-music.webp",
    "summary": "Développement d'une application MERN",
    "detailsContext": "(Projet personnel)",
    "details": "Mon premier projet personnel : une application MERN dont le but est de présenter des compositeurs de musique (ainsi qu'une sélection de leurs morceaux grâce à l'API iFrame de YouTube) dont les informations sont stockées dans une base de données MongoDB Atlas que j'alimente moi-même. Le site n'est pas tout à fait optimal, notamment concernant son UX/UI qui est passable (il méritera une refonte de son design ainsi qu'une migration SSR) mais je suis plutôt satisfait de certaines de ses fonctionnalités.",
    "responsiveIllustration": "/those-behind-the-music-responsive.webp",
    "deployment": "https://those-behind-the-music.vercel.app/",
    "githubLink": "https://github.com/yoannBonge/ThoseBehindTheMusic",
    "tools": ["MERN", "Typescript"],
    "reverseRow": true
  }
]
